In [1]:
from pyspark.sql import SparkSession, Row

spark = SparkSession.builder.appName("RowExample").getOrCreate()

your 131072x1 screen size is bogus. expect trouble
25/08/20 07:30:46 WARN Utils: Your hostname, KLZPC0015 resolves to a loopback address: 127.0.1.1; using 172.25.17.96 instead (on interface eth0)
25/08/20 07:30:46 WARN Utils: Set SPARK_LOCAL_IP if you need to bind to another address
Setting default log level to "WARN".
To adjust logging level use sc.setLogLevel(newLevel). For SparkR, use setLogLevel(newLevel).
25/08/20 07:30:50 WARN NativeCodeLoader: Unable to load native-hadoop library for your platform... using builtin-java classes where applicable
25/08/20 07:30:53 WARN Utils: Service 'SparkUI' could not bind on port 4040. Attempting port 4041.

In [ ]:
data = [
    (1, "Manta", 75000, "IT", 24),
    (2, "Dipankar", 30000, "Post Master", 27),
    (3, "Souvik", 60000, "Army Officer", 27),
    (4, "Soukarjya", 45000, "BDO", 26),
    (4, "Soukarjya", 45000, "BDO", 26),
    (5, "Arvind", 35000, "Business Data Analyst", 28),
    (6, "Prodipta", 25000, "Data Analyst", 28),
    (7, "Padma", 20000, "Data Analyst", 27),
    (8, "Panta", 125000, "Business Analyst", 27),
    (9, "Panta", 125000, "Business Analyst", 27)
]

In [3]:
df = spark.createDataFrame(data, ["id", "name", "salary", "department", "age"])
df.show()

+---+---------+------+--------------------+---+
| id|     name|salary|          department|age|
+---+---------+------+--------------------+---+
|  1|    Manta| 75000|                  IT| 24|
|  2| Dipankar| 30000|         Post Master| 27|
|  3|   Souvik| 60000|        Army Officer| 27|
|  4|Soukarjya| 45000|                 BDO| 26|
|  5|   Arvind| 35000|Business Data Ana...| 28|
|  6| Prodipta| 25000|        Data Analyst| 28|
|  7|    Padma| 20000|        Data Analyst| 27|
|  8|    Panta|125000|    Business Analyst| 27|
|  9|    Panta|125000|    Business Analyst| 27|
+---+---------+------+--------------------+---+

In [4]:
print("Removing dupliacte rows using distinct(): ")
df_distinct = df.distinct()
df_distinct.show()

Removing dupliacte rows using distinct():

+---+---------+------+--------------------+---+
| id|     name|salary|          department|age|
+---+---------+------+--------------------+---+
|  2| Dipankar| 30000|         Post Master| 27|
|  1|    Manta| 75000|                  IT| 24|
|  3|   Souvik| 60000|        Army Officer| 27|
|  4|Soukarjya| 45000|                 BDO| 26|
|  6| Prodipta| 25000|        Data Analyst| 28|
|  5|   Arvind| 35000|Business Data Ana...| 28|
|  9|    Panta|125000|    Business Analyst| 27|
|  7|    Padma| 20000|        Data Analyst| 27|
|  8|    Panta|125000|    Business Analyst| 27|
+---+---------+------+--------------------+---+

In [7]:
print("Unique departments: ")
df.select("name", "department").distinct().show()

Unique departments:

+---------+--------------------+
|     name|          department|
+---------+--------------------+
| Dipankar|         Post Master|
|    Manta|                  IT|
|Soukarjya|                 BDO|
|   Souvik|        Army Officer|
|   Arvind|Business Data Ana...|
| Prodipta|        Data Analyst|
|    Padma|        Data Analyst|
|    Panta|    Business Analyst|
+---------+--------------------+

In [8]:
print("Unique departments: ")
df.select("id", "name", "department").distinct().show()

Unique departments:

+---+---------+--------------------+
| id|     name|          department|
+---+---------+--------------------+
|  1|    Manta|                  IT|
|  2| Dipankar|         Post Master|
|  4|Soukarjya|                 BDO|
|  3|   Souvik|        Army Officer|
|  5|   Arvind|Business Data Ana...|
|  6| Prodipta|        Data Analyst|
|  9|    Panta|    Business Analyst|
|  7|    Padma|        Data Analyst|
|  8|    Panta|    Business Analyst|
+---+---------+--------------------+